# SetExportLineweightTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNExportOptions..::..SetExportLineweightTable Method
DGNExportOptions Class See Also
---
Sets the line weight table to use during export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetExportLineweightTable(
	ExportLineweightTable lineweightTable
)
```

Visual Basic
---
```text
Public Sub SetExportLineweightTable ( _
	lineweightTable As ExportLineweightTable _
)
```

Visual C++
---
```text
public:
void SetExportLineweightTable(
	ExportLineweightTable^ lineweightTable
)
```

# ### Parameters
lineweightTable
    Type: Autodesk.Revit.DB..::..ExportLineweightTable The line weight table to be set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace